Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectAttributes.YScale Property
 Gets or sets the Y scaling value. Changing this property will set the scaling type to ScaleXY.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double YScale { get; set; }
Public Property YScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
EmbeddedObjectAttributes Class
Tekla.Structures.Drawing Namespace